# Assignment on Statistics

1.An Institution wishes to find out their student’s ability in 
mathematics, reading and writing skills. The Institution 
wants to do an exploratory study to check the following 
information.

In [66]:
import pandas as pd
from scipy.stats import ttest_rel
from scipy.stats import chi2_contingency

In [3]:
data = pd.read_csv(r'Downloads\Students_Performance.csv')

In [4]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

a. Find out how many males and females participated in 
the test

In [6]:
gender_count= data['gender'].value_counts()

In [7]:
gender_count

female    518
male      482
Name: gender, dtype: int64

b. What do you think about the students' parental level of 
education?

In [9]:
parential_level = data['parental level of education'].value_counts()

In [10]:
parential_level

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

c. Who scores the most on average for math, reading and 
writing based on
i. Gender
ii. Test preparation course

In [14]:
gender_scores = data.groupby('gender')[['math score','reading score','writing score']].mean()

In [15]:
gender_scores

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

ii. Test preparation course

In [16]:
test_preparation_score = data.groupby('test preparation course')[['math score','reading score','writing score']].mean()

In [17]:
test_preparation_score

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

d. What do you think about the scoring variation for 
math, reading and writing based on

i. Gender

In [18]:
scoring_variation = data.groupby('gender')[['math score','reading score','writing score']].std()

In [19]:
scoring_variation

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

ii. Test preparation course

In [20]:
scoring_variation_test_prep = data.groupby('test preparation course')[['math score','reading score','writing score']].std()

In [21]:
scoring_variation_test_prep

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

e. The management needs your help to give bonus points 
to the top 25% of students based on their math score, 
so how will you help the management to achieve this.

In [37]:
top_math_score = data.loc[data['math score'] >= data['math score'].quantile(0.75), 'bonus points'] = 10

In [38]:
top_math_score

10

# Case Study on Testing of Hypothesis

2.A company started to invest in digital marketing as a new 
way of their product promotions. For that they collected 
data and decided to carry out a study on it.

In [39]:
data_1 = pd.read_csv(r'Downloads\Sales_add.csv')

In [41]:
data_1

,Month,Region,Manager,Sales_before_digital_add(in $),Sales_After_digital_add(in $)
0,Month-1,Region - A,Manager - A,132921,270390
1,Month-2,Region - A,Manager - C,149559,223334
2,Month-3,Region - B,Manager - A,146278,244243
3,Month-4,Region - B,Manager - B,152167,231808
4,Month-5,Region - C,Manager - B,159525,258402
5,Month-6,Region - A,Manager - B,137163,256948
6,Month-7,Region - C,Manager - C,130625,222106
7,Month-8,Region - A,Manager - A,131140,230637
8,Month-9,Region - B,Manager - C,171259,226261
9,Month-10,Region - C,Manager - B,141956,193735
10,Month-11,Region - B,Manager - C,159339,203175
11,Month-12,Region - A,Manager - A,178939,276279
12,Month-13,Region - B,Manager - A,145062,205180
13,Month-14,Region - A,Manager - A,151514,253131
14,Month-15,Region - C,Manager - A,147463,229336
15,Month-16,Region - A,Manager - B,177195,187305
16,Month-17,Region - A,Manager - C,140862,234908
17,Month-18,Region - C,Manager - B,167996,191517
18,Month-19,Region - B,Manager - A,132135,227040
19,Month-20,Region - A,Manager - B,152493,212579
20,Month-21,Region - B,Manager - A,147425,263388
21,Month-22,Region - A,Manager - C,130263,243020

a. The company wishes to clarify whether there is any 
increase in sales after stepping into digital marketing.

In [48]:
sales_before_digital_marketing = data_1['Sales_before_digital_add(in $)'].mean()

In [49]:
sales_before_digital_marketing

149239.95454545456

In [50]:
sales_after_digital_marketing = data_1['Sales_After_digital_add(in $)'].mean()

In [51]:
sales_after_digital_marketing

231123.72727272726

In [56]:
t_statistic, p_value = ttest_rel(data_1['Sales_before_digital_add(in $)'], data_1['Sales_After_digital_add(in $)'])

In [57]:
t_statistic

-12.09070525287017

In [58]:
p_value

6.336667004575778e-11

In [59]:
if p_value < 0.05:
    print("There is a significant increase in sales after digital marketing.")
else:
    print("There is no significant increase in sales after digital marketing.")

There is a significant increase in sales after digital marketing.

b.The company needs to check whether there is any 
dependency between the features “Region” and 
“Manager”.

In [63]:
dependency_check = pd.crosstab(data_1['Region'], data_1['Manager'])

In [64]:
dependency_check

Manager     Manager - A  Manager - B  Manager - C
Region
Region - A            4            3            3
Region - B            4            1            2
Region - C            1            3            1

In [67]:
chi2, p, dof, expected = chi2_contingency(dependency_check)

In [68]:
if p < 0.05:
    print("There is a significant dependency between Region and Manager.")
else:
    print("There is no significant dependency between Region and Manager.")

There is no significant dependency between Region and Manager.